*** Test the API
:PROPERTIES:
:CREATED:  [2023-10-29 Sun 15:20]
:END:

Enable the 8080 port in the firewall rules for cl-sh-1, then test whether the port is accessible:

#+BEGIN_SRC sh
nc -zv 124.222.229.246 8080
#+END_SRC

#+RESULTS:
Connection to 124.222.229.246 port 8080 [tcp/http-alt] succeeded!
[ Babel evaluation exited with code 0 ]


#+BEGIN_SRC python :session 2023-10-29 :results output
import requests
import json


#+END_SRC




*** Test the API
:PROPERTIES:
:CREATED:  [2023-10-29 Sun 15:05]
:END:

Test whether the port is accessible:

#+BEGIN_SRC sh
nc -zv 143.42.167.62 8080
#+END_SRC

#+RESULTS:
: Connection to 143.42.167.62 port 8080 [tcp/http-alt] succeeded!
: [ Babel evaluation exited with code 0 ]


#+BEGIN_SRC python :session 2023-10-29 :results output
import requests
import json


data = {
    'model': 'gpt-4',
    'messages': [
        {
            'role': 'system',
            'content': 'You will be provided with sentences, and your task is to help them sound natural in English.'
        },
        {
            'role': 'user',
            'content': 'The system will fetch the tracking information of orders and return the trackings to the Amazon stores by Amazon API.'
        }
    ],
    'temperature': 0,
    'max_tokens': 256
}

response = requests.post(
    'http://143.42.167.62:8080/openai/chat_completion/create',
    json=data
)
print(response.text)
#+END_SRC

#+RESULTS:
: {"choices":[{"finish_reason":"stop","index":0,"message":{"content":"The system will retrieve the tracking information for orders and relay this information back to the Amazon stores via the Amazon API.","role":"assistant"}}],"created":1698563412,"id":"chatcmpl-8EuE0rmSMBNvPEhyzBhccPybpAHXL","model":"gpt-4-0613","object":"chat.completion","usage":{"completion_tokens":23,"prompt_tokens":52,"total_tokens":75}}
